#include "EndScene.h"
#include "DxLib.h"

int wait_count;

/*********************************************************
	エンド画面　：　初期化処理
	引　数　：　なし
	戻り値　：　なし
**********************************************************/

int EndScene_Initialize(void)
{
	int ret = 0;

	wait_count = 0;

	return ret;
}


/*********************************************************
	ブロック機能　：　更新処理
	引　数　：　なし
	戻り値　：　なし
**********************************************************/

void EndScene_Update(void)
{
	wait_count++;
}


/*********************************************************
	ブロック機能　：　描画処理
	引　数　：　なし
	戻り値　：　なし
**********************************************************/

void EndScene_Draw(void)
{
	DrawString(10, 10, "エンド画面です", GetColor(255, 255, 255));
}

/*********************************************************
	エンド機能　：　修了確認処理
	引　数　：　なし
	戻り値　：　なし
**********************************************************/

int Get_EndTime(void)
{
	if (wait_count > 300)
	{
		return TRUE;
	}
	return FALSE;
}